# StructuralSectionConcreteRound Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionConcreteRound Class
Members See Also
---
Creates a new instance of Structural Section Concrete Round shape with the associated set of parameters, used to attach to structural element.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionConcreteRound : StructuralSectionRound
```

Visual Basic
---
```text
Public Class StructuralSectionConcreteRound _
	Inherits StructuralSectionRound
```

Visual C++
---
```text
public ref class StructuralSectionConcreteRound : public StructuralSectionRound
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRound Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionConcreteRound
# See Also
StructuralSectionConcreteRound Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace